**Introdução**

Esse é o desafio do Titanic, que é o mais utilizado e indicado para pessoas que são iniciantes em ciência de dados. Nele é preciso prever se um passageiro sobreviveu ou não ao naufrágio, sabendo algumas características pessoais do mesmo. As bases de dados que serão utilizadas ao longo deste trabalho foram retiradas do desafio da rede Kaggle,2 que é uma das melhores plataformas para cientistas de dados. 

[Fonte](https://rpubs.com/modelthinkingbr/titanic-fgv)

Descrição de colunas:
* survival: variável binária que representa se o indivíduo sobreviveu (1) ou não (0);
* pclass: em qual classe ele estava alojado;
* name: nome do passageiro;
* sex: gênero do passageiro;
* age: idade do passageiro;
* sibsp: número de esposos e/ou irmãos à bordo;
* parch: número de pais ou filhos à bordo;
* ticket: número da passagem;
* fare: preço pago pela passagem;
* cabin: número da cabine em que estava alojado;
* embarked: cidade em que embarcou.

[Fonte](https://rpubs.com/modelthinkingbr/titanic-fgv)

# Desafio Semana 11

In [21]:
# sempre carregar a biblioteca
import pandas as pd

In [22]:
# carregando os dados
df = pd.read_csv("data/titanic.csv")
df

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [75]:
df.sort_values(by=['Name']).reset_index()

,index,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,845,846,0,3,"Abbing, Mr. Anthony",male,42.0,0,0,C.A. 5547,7.5500,NaN,S
1,746,747,0,3,"Abbott, Mr. Rossmore Edward",male,16.0,1,1,C.A. 2673,20.2500,NaN,S
2,279,280,1,3,"Abbott, Mrs. Stanton (Rosa Hunt)",female,35.0,1,1,C.A. 2673,20.2500,NaN,S
3,308,309,0,2,"Abelson, Mr. Samuel",male,30.0,1,0,P/PP 3381,24.0000,NaN,C
4,874,875,1,2,"Abelson, Mrs. Samuel (Hannah Wizosky)",female,28.0,1,0,P/PP 3381,24.0000,NaN,C
...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,286,287,1,3,"de Mulder, Mr. Theodore",male,30.0,0,0,345774,9.5000,NaN,S
887,282,283,0,3,"de Pelsmaeker, Mr. Alfons",male,16.0,0,0,345778,9.5000,NaN,S
888,361,362,0,2,"del Carlo, Mr. Sebastiano",male,29.0,1,0,SC/PARIS 2167,27.7208,NaN,C
889,153,154,0,3,"van Billiard, Mr. Austin Blyler",male,40.5,0,2,A/5. 851,14.5000,NaN,S
890,868,869,0,3,"van Melkebeke, Mr. Philemon",male,NaN,0,0,345777,9.5000,NaN,S

In [73]:
df.sort_values(by=['Age', 'PassengerId']).reset_index()

,index,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,803,804,1,3,"Thomas, Master. Assad Alexander",male,0.42,0,1,2625,8.5167,NaN,C
1,755,756,1,2,"Hamalainen, Master. Viljo",male,0.67,1,1,250649,14.5000,NaN,S
2,469,470,1,3,"Baclini, Miss. Helene Barbara",female,0.75,2,1,2666,19.2583,NaN,C
3,644,645,1,3,"Baclini, Miss. Eugenie",female,0.75,2,1,2666,19.2583,NaN,C
4,78,79,1,2,"Caldwell, Master. Alden Gates",male,0.83,0,2,248738,29.0000,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,859,860,0,3,"Razi, Mr. Raihed",male,NaN,0,0,2629,7.2292,NaN,C
887,863,864,0,3,"Sage, Miss. Dorothy Edith ""Dolly""",female,NaN,8,2,CA. 2343,69.5500,NaN,S
888,868,869,0,3,"van Melkebeke, Mr. Philemon",male,NaN,0,0,345777,9.5000,NaN,S
889,878,879,0,3,"Laleff, Mr. Kristo",male,NaN,0,0,349217,7.8958,NaN,S
890,888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S

In [23]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

In [76]:
# criando a função de processamento dos dados
def processamento_df(df):
    
    # 3 primeiras linhas do df
    df_3_linhas = df.head(3)
    
    # selecionando aleatoriamente 100 linhas do df
    df_menor = df.sample(100)
    
    # removendo colunas com muitos dados nulos
    df = df.drop(columns='Cabin')
    
    # ordenando por idade menor para o maior
    df = df.sort_values("Age")
      
    # removendo dados duplicados
    df = df.drop_duplicates()
    
    # reset index
    df = df.reset_index()
    
    # lista de colunas
    colunas = list(df.columns) 
    
    # metricas: analise descritiva
    metricas = df.describe(include='all')
    
    return df_3_linhas, df_menor, df, colunas, metricas

In [77]:
# chamando a função processamento usando os dados do df
df_3_linhas, df_menor, df_teste, colunas, metricas = processamento_df(df)

In [78]:
# verificando se o retorno das 3 primeiras linhas está correto
df_3_linhas

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S

In [54]:
# verificando se o retorno dos dados aleatorios das 100 linhas está correto
df_menor

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
800,801,0,2,"Ponesell, Mr. Martin",male,34.0,0,0,250647,13.0000,NaN,S
118,119,0,1,"Baxter, Mr. Quigg Edmond",male,24.0,0,1,PC 17558,247.5208,B58 B60,C
857,858,1,1,"Daly, Mr. Peter Denis",male,51.0,0,0,113055,26.5500,E17,S
637,638,0,2,"Collyer, Mr. Harvey",male,31.0,1,1,C.A. 31921,26.2500,NaN,S
829,830,1,1,"Stone, Mrs. George Nelson (Martha Evelyn)",female,62.0,0,0,113572,80.0000,B28,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...
108,109,0,3,"Rekic, Mr. Tido",male,38.0,0,0,349249,7.8958,NaN,S
105,106,0,3,"Mionoff, Mr. Stoytcho",male,28.0,0,0,349207,7.8958,NaN,S
407,408,1,2,"Richards, Master. William Rowe",male,3.0,1,1,29106,18.7500,NaN,S
790,791,0,3,"Keane, Mr. Andrew ""Andy""",male,NaN,0,0,12460,7.7500,NaN,Q
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S

In [55]:
# verificando se o retorno da lista de colunas
colunas

['index',
 'PassengerId',
 'Survived',
 'Pclass',
 'Name',
 'Sex',
 'Age',
 'SibSp',
 'Parch',
 'Ticket',
 'Fare',
 'Embarked']

In [56]:
# verificando se o retorno do tratamento dos dados está correto
df_teste

,index,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Embarked
0,803,804,1,3,"Thomas, Master. Assad Alexander",male,0.42,0,1,2625,8.5167,C
1,755,756,1,2,"Hamalainen, Master. Viljo",male,0.67,1,1,250649,14.5000,S
2,644,645,1,3,"Baclini, Miss. Eugenie",female,0.75,2,1,2666,19.2583,C
3,469,470,1,3,"Baclini, Miss. Helene Barbara",female,0.75,2,1,2666,19.2583,C
4,78,79,1,2,"Caldwell, Master. Alden Gates",male,0.83,0,2,248738,29.0000,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,859,860,0,3,"Razi, Mr. Raihed",male,NaN,0,0,2629,7.2292,C
887,863,864,0,3,"Sage, Miss. Dorothy Edith ""Dolly""",female,NaN,8,2,CA. 2343,69.5500,S
888,868,869,0,3,"van Melkebeke, Mr. Philemon",male,NaN,0,0,345777,9.5000,S
889,878,879,0,3,"Laleff, Mr. Kristo",male,NaN,0,0,349217,7.8958,S
890,888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,S

In [80]:
# verificando se o retorno das metricas está correto
metricas.T

,count,unique,top,freq,mean,std,min,25%,50%,75%,max
index,891.0,NaN,NaN,NaN,445.0,257.353842,0.0,222.5,445.0,667.5,890.0
PassengerId,891.0,NaN,NaN,NaN,446.0,257.353842,1.0,223.5,446.0,668.5,891.0
Survived,891.0,NaN,NaN,NaN,0.383838,0.486592,0.0,0.0,0.0,1.0,1.0
Pclass,891.0,NaN,NaN,NaN,2.308642,0.836071,1.0,2.0,3.0,3.0,3.0
Name,891,891,"Thomas, Master. Assad Alexander",1,NaN,NaN,NaN,NaN,NaN,NaN,NaN
Sex,891,2,male,577,NaN,NaN,NaN,NaN,NaN,NaN,NaN
Age,714.0,NaN,NaN,NaN,29.699118,14.526497,0.42,20.125,28.0,38.0,80.0
SibSp,891.0,NaN,NaN,NaN,0.523008,1.102743,0.0,0.0,0.0,1.0,8.0
Parch,891.0,NaN,NaN,NaN,0.381594,0.806057,0.0,0.0,0.0,0.0,6.0
Ticket,891,681,1601,7,NaN,NaN,NaN,NaN,NaN,NaN,NaN
Fare,891.0,NaN,NaN,NaN,32.204208,49.693429,0.0,7.9104,14.4542,31.0,512.3292
Embarked,889,3,S,644,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [81]:
# salvando o df para um arquivo csv
df_teste.to_csv("dados_processados_20231019.csv")

# Insights:

- o preço máximo pago por uma passagem a bordo do Titanic foi 512.32
- a média de idade dos passageiros a bordo era de 29.69 anos
- idade mínima 0.42 ano
- idade máxima 80 anos
- a mediana de idade é de 28 anos

# Bônus: 

* traduzir colunas do dataset Titanic do inglês para o português

In [85]:
dict_tradutor.items()

dict_items([('PassengerId', 'IdPassageiro'), ('Survived', 'Sobreviveu'), ('Pclass', 'Classe'), ('Name', 'Nome'), ('Sex', 'Sexo'), ('Age', 'Idade'), ('SibSp', 'NumeroIrmaos'), ('Parch', 'NumeroPais'), ('Ticket', 'NumeroTicket'), ('Fare', 'PrecoTicket'), ('Cabin', 'NumeroCabine'), ('Embarked', 'PortoEmbarcacao')])

In [66]:
dict_tradutor = {
    'PassengerId': 'IdPassageiro',
    'Survived': 'Sobreviveu', # 0 = Não, 1 = Sim
    'Pclass': 'Classe', 
    'Name': 'Nome',
    'Sex': 'Sexo',
    'Age': 'Idade',
    'SibSp': 'NumeroIrmaos',
    'Parch':  'NumeroPais',
    'Ticket': 'NumeroTicket',
    'Fare': 'PrecoTicket',
    'Cabin' : 'NumeroCabine',
    'Embarked': 'PortoEmbarcacao' # C = Cherbourg, Q = Queenstown, S = Southampton
}

colunas_portugues = []

for chave, valor in dict_tradutor.items():
    colunas_portugues.append(valor)

colunas_portugues

['IdPassageiro',
 'Sobreviveu',
 'Classe',
 'Nome',
 'Sexo',
 'Idade',
 'NumeroIrmaos',
 'NumeroPais',
 'NumeroTicket',
 'PrecoTicket',
 'NumeroCabine',
 'PortoEmbarcacao']

In [83]:
# substituindo os nomes das colunas 
df.columns = colunas_portugues

In [84]:
df

,IdPassageiro,Sobreviveu,Classe,Nome,Sexo,Idade,NumeroIrmaos,NumeroPais,NumeroTicket,PrecoTicket,NumeroCabine,PortoEmbarcacao
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q